## ¿Qué diferencia hay entre una Serie y un DataFrame?

In [ ]:
La diferencia entre una serie y DataFrame es que mientras la serie es unidimensional, el dataframe es bidimensional. La serie similar a una lista, tiene indice para etiquetar cada elemento y el dataframe es similar a una tabla, con filas y columnas etiquetadas. Y el dataframe es más fácil de leer.

## Momento de trabajar con Series. Contesta a las siguientes preguntas.

In [4]:
import numpy as np
import pandas as pd

### Crea dos listas:

- Una que se llame "valores" que tenga 7 números aleatorios.
- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [6]:
lista_valores = [2, 9, 21, 32, 46, 37, 1]
lista_indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

### A partir de estas dos listas:

- Crea una Serie donde la variable "valores" sean los valores de la Serie y la variable "indices" sean los índices de la Serie.
- A partir de las dos listas anteriores, crea un diccionario usando un bucle for. Para hacer esto, tenemos el método zip que nos permite iterar por dos listas a la vez.
- Crea una Serie con el diccionario creado en el punto anterior.

In [8]:
serie_pd = pd.Series(lista_valores, index= lista_indices)
dicc = { indice: valor for indice, valor in zip(lista_indices, lista_valores) 
        }
dicc

{'lunes': 2,
 'martes': 9,
 'miercoles': 21,
 'jueves': 32,
 'viernes': 46,
 'sabado': 37,
 'domingo': 1}

In [9]:
serie_dicc = pd.Series(dicc)
serie_dicc

lunes         2
martes        9
miercoles    21
jueves       32
viernes      46
sabado       37
domingo       1
dtype: int64

### Contesta a las siguientes preguntas sobre la Serie:

- ¿Qué forma tiene esta última Serie?
- ¿Qué tipo de datos tiene?
- ¿Qué tamaño tiene?
- ¿Cuáles son los índices de la Serie?
- ¿Y los values?
- Extrae el valor para el índice "Lunes".
- Extrae el valor para los índices "Lunes", "Martes" y "Miércoles".
- Extrae el valor para los índices "Lunes" y "Domingo".

In [10]:
print(serie_dicc.shape)

(7,)

In [11]:
print(serie_dicc.dtype)

int64

In [12]:
print(serie_dicc.size)

7

In [14]:
print(serie_dicc.index)

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [15]:
print(serie_dicc.values)

[ 2  9 21 32 46 37  1]

In [19]:
print(serie_dicc[['lunes']])

lunes    2
dtype: int64

In [18]:
print(serie_dicc[['lunes', 'martes', 'miercoles']])

lunes         2
martes        9
miercoles    21
dtype: int64

In [20]:
print(serie_dicc[['lunes', 'domingo']])

lunes      2
domingo    1
dtype: int64

## Es el turno de los DataFrames.

### Realiza las siguientes acciones:

- Crea un array de dos dimensiones con 4 filas y 3 columnas.
- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".
- Descarga el archivo "medallas" y carga el DataFrame.
- Usando el loc, extrae todas las columnas de la fila de Tailandia.
- Usando el loc, extrae todas las columnas de China e Irán.
- Usando el loc, extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
- Usando el iloc, extrae la información de la India. Devuelve todas las columnas.
- Usando el iloc, extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
- Utilizando el código del ejercicio anterior, selecciona únicamente las columnas "Oro", "Plata" y "Bronce".

In [21]:
array = np.random.randint(1, 100, size=(4 ,3))
array

array([[79, 58, 65],
       [62, 70, 42],
       [37, 14, 33],
       [50, 35, 24]])

In [22]:
df = pd.DataFrame(array, columns=['España', 'Francia', 'Italia'])
df

   España  Francia  Italia
0      79       58      65
1      62       70      42
2      37       14      33
3      50       35      24

In [25]:
df_medallas = pd.read_csv('medallas.csv')
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

In [31]:
fila_tailandia = df_medallas.loc[df_medallas['País']=='Tailandia']
fila_tailandia

   Unnamed: 0       País  Oro  Plata  Bronce
6           7  Tailandia  132    175     278

In [36]:
fila_tailandia = df_medallas.loc[df_medallas['País'].isin(['China', 'Irán'])]
fila_tailandia

   Unnamed: 0   País   Oro  Plata  Bronce
0           1  China  1473    994     720
3           4   Irán   179    181     197

In [37]:
fila_tailandia1 = df_medallas.loc[df_medallas['País'].isin(['China', 'Irán']),['Oro', 'Plata', 'Bronce']]
fila_tailandia1

    Oro  Plata  Bronce
0  1473    994     720
3   179    181     197

### Contesta a las siguientes preguntas:

- ¿Qué país consiguió más de 200 medallas de oro?
- ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
- ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
- Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.